In [22]:
import pandas as pd

In [23]:
import numpy as np

In [24]:
from numpy.random import randn as rn

In [25]:
np.random.seed(100)
r = rn(5,4)
r

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [26]:
pd.DataFrame(r)

          0         1         2         3
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [27]:
row = ['a','b','c','d','e']
col = ['w','x','y','z']
df = pd.DataFrame(r, index=row, columns=col)

In [28]:
df[['x','w']]

          x         w
a  0.342680 -1.749765
b  0.514219  0.981321
c  0.255001 -0.189496
d  0.816847 -0.583595
e  1.029733 -0.531280

In [29]:
df['new'] = df['w']+ df['z']

In [30]:
df

          w         x         y         z       new
a -1.749765  0.342680  1.153036 -0.252436 -2.002202
b  0.981321  0.514219  0.221180 -1.070043 -0.088723
c -0.189496  0.255001 -0.458027  0.435163  0.245668
d -0.583595  0.816847  0.672721 -0.104411 -0.688006
e -0.531280  1.029733 -0.438136 -1.118318 -1.649599

In [31]:
# inplace to replace the original dataset or persist change
df.drop('a', inplace=True) 
# or df = df.drop('a')
df

          w         x         y         z       new
b  0.981321  0.514219  0.221180 -1.070043 -0.088723
c -0.189496  0.255001 -0.458027  0.435163  0.245668
d -0.583595  0.816847  0.672721 -0.104411 -0.688006
e -0.531280  1.029733 -0.438136 -1.118318 -1.649599

In [32]:
# axis = 0 means row
df.drop('w',axis=1, inplace=True) 
# or df = df.drop('w')
df

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
c  0.255001 -0.458027  0.435163  0.245668
d  0.816847  0.672721 -0.104411 -0.688006
e  1.029733 -0.438136 -1.118318 -1.649599

In [33]:
df.loc[['c','b']]

          x         y         z       new
c  0.255001 -0.458027  0.435163  0.245668
b  0.514219  0.221180 -1.070043 -0.088723

In [34]:
df.iloc[[1,2]]

          x         y         z       new
c  0.255001 -0.458027  0.435163  0.245668
d  0.816847  0.672721 -0.104411 -0.688006

NOTE : loc worked with named indexes but iloc(Integer location) works with default indexes

In [35]:
df.loc[['b','c'],['y']]

          y
b  0.221180
c -0.458027

In [36]:
df.loc[['b','e'],['y','z']]

          y         z
b  0.221180 -1.070043
e -0.438136 -1.118318

In [37]:
df.iloc[[1,2],[2,3]]

          z       new
c  0.435163  0.245668
d -0.104411 -0.688006

In [38]:
df.iloc[0:3,:]

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
c  0.255001 -0.458027  0.435163  0.245668
d  0.816847  0.672721 -0.104411 -0.688006

In [39]:
df.iloc[::2,:]

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
d  0.816847  0.672721 -0.104411 -0.688006

In [40]:
df.iloc[::-1,0:3]

          x         y         z
e  1.029733 -0.438136 -1.118318
d  0.816847  0.672721 -0.104411
c  0.255001 -0.458027  0.435163
b  0.514219  0.221180 -1.070043

In [41]:
df.ix['a']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [42]:
df

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
c  0.255001 -0.458027  0.435163  0.245668
d  0.816847  0.672721 -0.104411 -0.688006
e  1.029733 -0.438136 -1.118318 -1.649599

In [43]:
df>0

      x      y      z    new
b  True   True  False  False
c  True  False   True   True
d  True   True  False  False
e  True  False  False  False

In [44]:
df[df>0]

          x         y         z       new
b  0.514219  0.221180       NaN       NaN
c  0.255001       NaN  0.435163  0.245668
d  0.816847  0.672721       NaN       NaN
e  1.029733       NaN       NaN       NaN

In [45]:
df.loc[['b','c','d']]> 0

      x      y      z    new
b  True   True  False  False
c  True  False   True   True
d  True   True  False  False

In [46]:
df[df['x']> .5]

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
d  0.816847  0.672721 -0.104411 -0.688006
e  1.029733 -0.438136 -1.118318 -1.649599

In [47]:
df[(df['x']> 0) & (df['y']> 0)]

          x         y         z       new
b  0.514219  0.221180 -1.070043 -0.088723
d  0.816847  0.672721 -0.104411 -0.688006

In [48]:
# reset to default index
df.reset_index(drop=True, inplace=True)

In [49]:
df

          x         y         z       new
0  0.514219  0.221180 -1.070043 -0.088723
1  0.255001 -0.458027  0.435163  0.245668
2  0.816847  0.672721 -0.104411 -0.688006
3  1.029733 -0.438136 -1.118318 -1.649599

In [50]:
# set new index from col
df.set_index('z', inplace=True)

In [51]:
df.index

Float64Index([ -1.0700433305682933,  0.43516348812289213, -0.10441114339062771,
               -1.1183182462554362],
             dtype='float64', name='z')

In [52]:
df.loc[0.43516348812289213]

x      0.255001
y     -0.458027
new    0.245668
Name: 0.43516348812289213, dtype: float64

In [53]:
l = 'abc def ghi jkl'

In [54]:
df['n'] = l.split()

In [55]:
df

                  x         y       new    n
z
-1.070043  0.514219  0.221180 -0.088723  abc
 0.435163  0.255001 -0.458027  0.245668  def
-0.104411  0.816847  0.672721 -0.688006  ghi
-1.118318  1.029733 -0.438136 -1.649599  jkl

In [56]:
df.set_index('n', inplace=True)

In [57]:
df.loc[['abc','def']]

            x         y       new
n
abc  0.514219  0.221180 -0.088723
def  0.255001 -0.458027  0.245668

In [71]:
df1 = pd.DataFrame({'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[8,6,np.nan]})

In [72]:
df1

     a    b    c
0  1.0  5.0  8.0
1  2.0  NaN  6.0
2  NaN  NaN  NaN

In [78]:
# dropna is required to drop null values
df1.dropna(axis=0, thresh=2)

     a    b    c
0  1.0  5.0  8.0
1  2.0  NaN  6.0

In [80]:
# fill na null values with some values
df1.fillna(df1['a'].mean())

     a    b    c
0  1.0  5.0  8.0
1  2.0  1.5  6.0
2  1.5  1.5  1.5

In [91]:
d = {'name':['rohit','shishir','tarun','rakesh','tarun', 'rohit','shishir'],
    'income':[100,345,234,567,789,454,456],
     'com':['marcher','sap','ibm','windows','bhel','marcher','sap']
    }

In [92]:
df2 = pd.DataFrame(d)
df2

      name  income      com
0    rohit     100  marcher
1  shishir     345      sap
2    tarun     234      ibm
3   rakesh     567  windows
4    tarun     789     bhel
5    rohit     454  marcher
6  shishir     456      sap

In [93]:
df2.groupby('name').mean()

         income
name
rakesh    567.0
rohit     277.0
shishir   400.5
tarun     511.5

In [94]:
df2.groupby('name').sum()

         income
name
rakesh      567
rohit       554
shishir     801
tarun      1023

In [96]:
df3 = df2.groupby('name').describe()
df3

        income
         count   mean         std    min     25%    50%     75%    max
name
rakesh     1.0  567.0         NaN  567.0  567.00  567.0  567.00  567.0
rohit      2.0  277.0  250.315801  100.0  188.50  277.0  365.50  454.0
shishir    2.0  400.5   78.488853  345.0  372.75  400.5  428.25  456.0
tarun      2.0  511.5  392.444264  234.0  372.75  511.5  650.25  789.0

In [105]:
# how to access col inside col
df3['income']['count']

name
rakesh     1.0
rohit      2.0
shishir    2.0
tarun      2.0
Name: count, dtype: float64

In [106]:
df4 = df3.loc['rohit']
df4

income  count      2.000000
        mean     277.000000
        std      250.315801
        min      100.000000
        25%      188.500000
        50%      277.000000
        75%      365.500000
        max      454.000000
Name: rohit, dtype: float64

In [107]:
# how to access row inside row
df4.loc['income'].loc['mean']

277.0

In [108]:
pd.DataFrame(df2.groupby('name').describe().loc['rohit'])

                   rohit
income count    2.000000
       mean   277.000000
       std    250.315801
       min    100.000000
       25%    188.500000
       50%    277.000000
       75%    365.500000
       max    454.000000

In [109]:
# transpose - row to column or column to row
pd.DataFrame(df2.groupby('name').describe().loc['rohit']).T

      income
       count   mean         std    min    25%    50%    75%    max
rohit    2.0  277.0  250.315801  100.0  188.5  277.0  365.5  454.0

In [111]:
df5 = pd.DataFrame(df2.groupby('name').describe().loc['rohit']).transpose()

In [112]:
df5['income']['std']

rohit    250.315801
Name: std, dtype: float64

In [114]:
daf1 = pd.DataFrame({
    'A':[2,3,4,6,7],
    'B':[5,6,7,9,8],
    'C':[23,33,45,45,55]},
    index=[0,1,2,3,4]
)

In [115]:
daf2 = pd.DataFrame({
    'A':[4,6,7,8,9],
    'B':[1,9,7,6,3],
    'C':[13,23,35,55,65]},
    index=[5,6,7,8,9]
)

In [116]:
daf3 = pd.DataFrame({
    'A':[2,3,4,6,7],
    'B':[5,6,7,9,8],
    'C':[23,33,45,45,55]},
    index=[10,11,12,13,14]
)

In [119]:
#concatination
df = pd.concat([daf1,daf2,daf3])

In [126]:

df1 = pd.DataFrame({'key':['ko','k1','k2','k3'],
                 'x':[1,2,3,4],
                  'y':[4,5,6,7]
                 })
df1

  key  x  y
0  ko  1  4
1  k1  2  5
2  k2  3  6
3  k3  4  7

In [127]:
df2 = pd.DataFrame({'key':['ko','k6','k2','k8'],
                 'a':[1,2,3,4],
                  'b':[4,5,6,7]
                 })
df2

  key  a  b
0  ko  1  4
1  k6  2  5
2  k2  3  6
3  k8  4  7

In [132]:
#merge - inner
df3 = pd.merge(df1,df2)
df3

  key  x  y  a  b
0  ko  1  4  1  4
1  k2  3  6  3  6

In [133]:
#merge - left
df4 = pd.merge(df1,df2, how='left')
df4

  key  x  y    a    b
0  ko  1  4  1.0  4.0
1  k1  2  5  NaN  NaN
2  k2  3  6  3.0  6.0
3  k3  4  7  NaN  NaN

In [134]:
#merge - right
df5 = pd.merge(df1,df2, how='right')
df5

  key    x    y  a  b
0  ko  1.0  4.0  1  4
1  k2  3.0  6.0  3  6
2  k6  NaN  NaN  2  5
3  k8  NaN  NaN  4  7

In [137]:
#merge -
df5 = pd.merge(df1,df2, how='right', left_on='x',right_on='a')
df5

  key_x  x  y key_y  a  b
0    ko  1  4    ko  1  4
1    k1  2  5    k6  2  5
2    k2  3  6    k2  3  6
3    k3  4  7    k8  4  7

In [140]:
df1.set_index('key', inplace=True)
df1

KeyError: "None of ['key'] are in the columns"

In [142]:
df2.set_index('key', inplace=True)
df2

     a  b
key
ko   1  4
k6   2  5
k2   3  6
k8   4  7

NOTE : merge you give column name but in join you give index

In [143]:
# join - by default left join
df1.join(df2)

     x  y    a    b
key
ko   1  4  1.0  4.0
k1   2  5  NaN  NaN
k2   3  6  3.0  6.0
k3   4  7  NaN  NaN

In [144]:
df1.join(df2, how='right')

       x    y  a  b
key
ko   1.0  4.0  1  4
k6   NaN  NaN  2  5
k2   3.0  6.0  3  6
k8   NaN  NaN  4  7

In [145]:
df1.join(df2, how='outer')

       x    y    a    b
key
k1   2.0  5.0  NaN  NaN
k2   3.0  6.0  3.0  6.0
k3   4.0  7.0  NaN  NaN
k6   NaN  NaN  2.0  5.0
k8   NaN  NaN  4.0  7.0
ko   1.0  4.0  1.0  4.0